/*Пусть дано две числовых переменных num1 и num2.
Напишите программу на JS, которая проверяет, что переменные именно числовые 
и выводит в консоль значение num1 в степени num2. 
Для подсета используйте цикл, а не стандартный.
Сравните результат, полученный вашим кодом и стандартной операцией ''.
Результат сравнения выведите в консоль.*/

num1 = 5;
num2 = 2;

if (typeof (num1) == "number" && typeof (num2)== "number")
    console.log("Переменные числовые")
else
    console.log("Как минимум одна из переменных не числовая")

res=num1
for(let i=1; i<num2; i++){
    res*=num1;
}

console.log(`a^b=${res}`)