/*Пусть дано две числовых переменных num1 и num2.
Напишите программу на JS, которая проверяет, что переменные именно числовые 
и выводит в консоль значение num1 в степени num2. 
Для подсета используйте цикл, а не стандартный.
Сравните результат, полученный вашим кодом и стандартной операцией ''.
Результат сравнения выведите в консоль.*/

const num1 = 5;
const num2 = 2;

if (typeof (num1) === "number" && typeof (num2) === "number")
    console.log("Переменные числовые")
else
    console.log("Как минимум одна из переменных не числовая")

let res1=num1
for(let i=1; i<num2; i++){
    res1*=num1;
}

console.log(`num1^num2=${res1}`)

let res2=num1**num2;
console.log(`num1**num2=${res2}`)

console.log(`(num1^num2===num**num2) => ${res1===res2}`)